src/cfe/КСП/InformationRegisters/СостоянияЗаказовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СостоянияЗаказовКлиентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроцентОтгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заказ</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/Documents/ВозвратТоваровОтКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВозвратТоваровОтКлиента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДокументРеализации</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cfe/КСП/CommonModules/crm_RetailCRMОбработка/Ext/Module.bsl
&НаСервере
Функция УТ11_ПолучитьСвойство(Наименование, НазначениеСвойства, Тип = "Свойство", ТипЗначения = "Строка") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвойстваОбъектов.Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК СвойстваОбъектов
	|ГДЕ
	|	СвойстваОбъектов.Заголовок 	= &Наименование
	|	И СвойстваОбъектов.НаборСвойств = &НазначениеСвойства";
	
	Запрос.УстановитьПараметр("НазначениеСвойства", НазначениеСвойства);
	Запрос.УстановитьПараметр("Наименование", 		Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();                      
	
	ЭтоСведение = ?(Тип = "Сведение", Истина, Ложь);
	ТипЗначенияСвойства = Новый ОписаниеТипов("Строка", ,
										  Новый КвалификаторыСтроки(99, ДопустимаяДлина.Переменная));
	НазваниеТЧ	= ?(Тип = "Свойство", "ДополнительныеСведения", "ДополнительныеРеквизиты");					
	
	Если ТипЗначения = "Число" Тогда 
		ТипЗначенияСвойства = Новый ОписаниеТипов("Число",
							  Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный));
	КонецЕсли;
										  
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда                         
		Свойство = ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		
		Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		Свойство.Наименование 				= Наименование;
		Свойство.Заголовок 					= Наименование;                
		Свойство.ЭтоДополнительноеСведение 	= ЭтоСведение;
		Свойство.НаборСвойств 				= НазначениеСвойства;
		Свойство.ТипЗначения 				= ТипЗначенияСвойства;
		Свойство.Виден 						= Истина;
		Свойство.Доступен 					= Истина;

		Свойство.Записать();

		Свойство = Свойство.Ссылка;          
		
		//ЕНС
		ОбновитьПовторноИспользуемыеЗначения();
		
	КонецЕсли;
	
	Если НазначениеСвойства[НазваниеТЧ].Найти(Свойство) = Неопределено Тогда
		
		НаборОбъект = НазначениеСвойства.ПолучитьОбъект();
		НоваяСтрока = НаборОбъект[НазваниеТЧ].Добавить();
		НоваяСтрока.Свойство = Свойство;

		НаборОбъект.Записать();
		
		//ЕНС
		ОбновитьПовторноИспользуемыеЗначения();

	КонецЕсли;

	Возврат Свойство;

КонецФункции

&НаСервере
Процедура УТ11_УстановитьСвойствоУОбъекта(Объект, Свойство, Значение) Экспорт
	
	Попытка 
		ЗаписьРегистра = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Объект 	= Объект;
		ЗаписьРегистра.Свойство = Свойство;
		ЗаписьРегистра.Значение = Значение;
		ЗаписьРегистра.Записать(Истина);
	Исключение 
	КонецПопытки;

КонецПроцедуры

&НаСервере
Функция УТ11_ПолучитьЗначениеСвойстваОбъекта(Об, Свойство) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = &Свойство
	|	И ЗначенияСвойствОбъектов.Объект = &Объект";

	Запрос.УстановитьПараметр("Свойство", 	Свойство);
	Запрос.УстановитьПараметр("Объект", 	Об);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	Иначе
		Возврат Неопределено;	
	КонецЕсли;

КонецФункции

&НаСервере
Функция УТ11_ВернутьВозврат (Реализация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВозвратТоваровОтКлиента.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ВозвратТоваровОтКлиента КАК ВозвратТоваровОтКлиента
		|ГДЕ
		|	ВозвратТоваровОтКлиента.ДокументРеализации = &ДокументРеализации
		|	И ВозвратТоваровОтКлиента.Проведен
		|";

	Запрос.УстановитьПараметр("ДокументРеализации", Реализация);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	искВозврат = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	Если Выборка.Следующий() Тогда
		искВозврат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат искВозврат;
	
КонецФункции

Функция УТ11_ПолучитьСостояниеЗаказа(док) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияЗаказовКлиентов.Состояние КАК Состояние
		|ИЗ
		|	РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
		|ГДЕ
		|	СостоянияЗаказовКлиентов.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", док);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Состояние = Неопределено;
	Пока Выборка.Следующий() Цикл
		Состояние = Выборка.Состояние;
	КонецЦикла;
	
	Возврат Состояние;	
	
КонецФункции

Функция УТ11_ВернутьКонтрагентаПоID (ИД, ТипКлиента) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеСведения.Свойство КАК Свойство,
	|	ДополнительныеСведения.Значение КАК Значение,
	|	ДополнительныеСведения.Объект КАК Объект
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Значение = &Значение
	|	И ДополнительныеСведения.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Значение", ИД);
	СвойствоКонтрагентов = crm_RetailCRMОбработка.УТ11_ПолучитьСвойство("ИД", Справочники.НаборыДополнительныхРеквизитовИСведений.УдалитьСправочник_Контрагенты);
	Запрос.УстановитьПараметр("Свойство", СвойствоКонтрагентов);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Если ТипЗнч(Выборка.Объект) = Тип("СправочникСсылка.Контрагенты") Тогда 
			Если ТипКлиента = "customer" и Выборка.Объект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда		//найденный контрагент должен быть физ лицом
				искКонт = Выборка.Объект;
			ИначеЕсли 
				ТипКлиента = "customer_corporate" и Выборка.Объект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда		//найденный контрагент должен быть юр лицом
				искКонт = Выборка.Объект;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(искКонт) Тогда 
			Прервать;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат искКонт;
	
КонецФункции

Функция УТ11_ВернутьПартнераПоID (ИД, типКлиента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеСведения.Свойство КАК Свойство,
	|	ДополнительныеСведения.Значение КАК Значение,
	|	ДополнительныеСведения.Объект КАК Объект
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Значение = &Значение
	|	И ДополнительныеСведения.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Значение", ИД);
	СвойствоПартнеров = crm_RetailCRMОбработка.УТ11_ПолучитьСвойство("ИД", Справочники.НаборыДополнительныхРеквизитовИСведений.УдалитьСправочник_Партнеры);
	Запрос.УстановитьПараметр("Свойство", СвойствоПартнеров);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Если ТипЗнч(Выборка.Объект) = Тип("СправочникСсылка.Партнеры") Тогда 
			Если ТипКлиента = "customer" и Выборка.Объект.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо Тогда		//найденный контрагент должен быть физ лицом
				искПарт = Выборка.Объект;
			ИначеЕсли ТипКлиента = "customer_corporate" и Выборка.Объект.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.Компания Тогда
				искПарт = Выборка.Объект;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(искПарт) Тогда 
			Прервать;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат искПарт;
	
КонецФункции

Функция УТ11_ВернутьКонтрагентаПоТелефону_Почте (Почта="", тНомер="") Экспорт 
	
	Если Почта <> "" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|ГДЕ
		|	КонтрагентыКонтактнаяИнформация.Тип = &Тип
		|	И КонтрагентыКонтактнаяИнформация.Вид = &Вид
		|	И КонтрагентыКонтактнаяИнформация.Представление = &Представление";
		
		Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.EmailКонтрагента);
		Запрос.УстановитьПараметр("Представление", Почта);
		Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		
		Результат = Запрос.Выполнить().Выгрузить();
		Если Результат.Количество() Тогда
			искКонт = Результат[0].Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	//если не нашли, продолжаем искать по номеру
	Если Не ЗначениеЗаполнено(искКонт) и тНомер <> "" Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Ссылка,
		|	КонтактнаяИнформация.Представление
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Представление ПОДОБНО &Представление";
		
		Запрос.УстановитьПараметр("Представление", "%" + тНомер + "%");
		
		Результат = Запрос.Выполнить().Выгрузить();
		Если Результат.Количество() Тогда
			искКонт = Результат[0].Ссылка;
		КонецЕсли;
	КонецЕсли; 
	
	Возврат искКонт;
	
КонецФункции
